Repository: HerniRG/DevCollab
Catalog: *.lproj/Localizable.strings
Languages: es

# login_vm_verification_resent
source: ✅ Verification email resent.
es: ✅ Correo de verificación reenviado.

# login_vm_verification_resent_error
source: ❌ Error resending verification email.
es: ❌ Error al reenviar el correo de verificación.

# login_vm_logout_error
source: ❌ Error logging out.
es: ❌ Error al cerrar sesión.

# perfil_vm_project_deleted
source: Project deleted successfully.
es: Proyecto eliminado correctamente.

# perfil_vm_project_delete_error_format
source: Error deleting project: %@
es: Error al eliminar proyecto: %@

# perfil_vm_name_empty
source: Name cannot be empty.
es: El nombre no puede estar vacío.

# perfil_vm_name_exceeded_format
source: Name exceeds %d characters.
es: El nombre excede los %d caracteres.

# perfil_vm_description_empty
source: Description cannot be empty.
es: La descripción no puede estar vacía.

# perfil_vm_description_exceeded_format
source: Description exceeds %d characters.
es: La descripción excede los %d caracteres.

# perfil_vm_no_language
source: Select at least one language.
es: Selecciona al menos un lenguaje.

# perfil_vm_no_user_to_update
source: No user to update.
es: No hay usuario para actualizar

# perfil_vm_profile_updated
source: Profile updated successfully.
es: Perfil actualizado con éxito.

# perfil_vm_profile_update_error_format
source: Error updating profile: %@
es: Error al actualizar el perfil: %@

# proyectos_vm_error_fetch_projects_format
source: ❌ Error fetching projects: %@
es: ❌ Error al obtener proyectos: %@

# proyectos_vm_error_fetch_solicitudes_project_format
source: Error fetching requests for project %@: %@
es: Error al obtener solicitudes para el proyecto %@: %@

# proyectos_vm_error_fetch_solicitudes_format
source: ❌ Error fetching requests: %@
es: ❌ Error al obtener solicitudes: %@

# register_vm_missing_fields
source: Please fill in all fields.
es: Por favor, completa todos los campos.

# register_vm_success
source: Registration successful. Please verify your email to confirm your account.
es: Registro exitoso. Verifica tu correo para confirmar tu cuenta.

# solicitudes_vm_error_fetch_format
source: ❌ Error fetching requests: %@
es: ❌ Error al obtener solicitudes: %@

# request_abandoned
source: You have abandoned this project
es: Has abandonado este proyecto

# request_abandoned_accessibility
source: Your request has been marked as abandoned
es: Tu solicitud ha quedado en estado abandonado

# delete_account_title
source: Delete Account?
es: ¿Eliminar cuenta?

# delete_account_message
source: This action will permanently delete your account and all your data. You will not be able to recover them.
es: Esta acción eliminará permanentemente tu cuenta y todos tus datos. No podrás recuperarlos.

# delete_account_confirm
source: Delete Account
es: Eliminar cuenta

# delete_account_cancel
source: Cancel
es: Cancelar

# delete_account_error_firestore
source: There was a problem deleting your data. Please try again.
es: Hubo un problema eliminando tus datos. Inténtalo de nuevo.

# delete_account_error_auth
source: Could not delete your authentication account. Please try again later.
es: No se pudo eliminar tu cuenta de autenticación. Inténtalo más tarde.

# delete_account_error_not_found
source: Account not found. Please log in again.
es: No se encontró la cuenta. Por favor, inicia sesión de nuevo.

# delete_account_success
source: Your account has been successfully deleted.
es: Tu cuenta ha sido eliminada correctamente.
