Repository: HerniRG/DevCollab
Catalog: *.lproj/Localizable.strings
Languages: es

# auth_invalid_email
source: The email address is not valid.
es: El correo electrónico no es válido.

# auth_weak_password
source: The password is too weak.
es: La contraseña es demasiado débil.

# auth_email_in_use
source: The email address is already in use.
es: El correo electrónico ya está en uso.

# auth_user_not_found
source: No user found with that email.
es: No se encontró un usuario con ese correo.

# auth_wrong_password
source: Incorrect username or password.
es: Usuario o contraseña incorrectos.

# auth_email_not_verified
source: The email address has not been verified. Please check your inbox.
es: El correo electrónico no ha sido verificado. Por favor, revisa tu bandeja de entrada.

# auth_email_exists
source: ❌ A user with this email is already registered.
es: ❌ Ya existe un usuario registrado con este correo.

source: Project not found.
es: Proyecto no encontrado.

# unknown_creator
source: Unknown
es: Desconocido

# request_already_abandoned
source: ❌ You cannot request this project again because you abandoned it before.
es: ❌ No puedes volver a solicitar este proyecto porque lo abandonaste anteriormente.

# max_approved_requests
source: ❌ You are already approved in 2 projects. You cannot request more.
es: ❌ Ya estás aprobado en 2 proyectos. No puedes solicitar más.

source: State not found.
es: Estado no encontrado.

source: User not found.
es: Usuario no encontrado.

source: Show password
es: Mostrar contraseña

source: Hide password
es: Ocultar contraseña

# email_placeholder
source: Email
es: Correo electrónico

# password_placeholder
source: Enter your password
es: Contraseña

# name_placeholder
source: Name
es: Nombre

# description_placeholder
source: Description
es: Descripción

# email_placeholder_hint
source: Enter your email
es: Ingrese su correo electrónico

# password_placeholder_hint
source: Enter your password
es: Ingrese su contraseña

# name_placeholder_hint
source: Enter your name
es: Ingrese su nombre

# description_placeholder_hint
source: Enter a short description
es: Ingrese una breve descripción

# password_visible_hint
source: The password is visible
es: La contraseña es visible

# password_hidden_hint
source: The password is hidden
es: La contraseña está oculta

# toggle_password_visibility_hint
source: Tap to toggle password visibility
es: Toca para cambiar la visibilidad de la contraseña

source: Select languages
es: Seleccionar lenguajes

# select_languages_hint
source: Opens the list of programming languages
es: Abre la lista para elegir lenguajes de programación

source: Programming Languages
es: Lenguajes de Programación

source: Done
es: Hecho

# close_languages_list
source: Close the languages list
es: Cierra la lista de lenguajes

# selected_language_hint
source: Selected. Tap to unselect
es: Seleccionado. Pulsa para deseleccionar

# unselected_language_hint
source: Not selected. Tap to select
es: No seleccionado. Pulsa para seleccionar

source: Project name: %@
es: Nombre del proyecto: %@

# project_languages
source: Languages: %@
es: Lenguajes: %@

source: Status:
es: Estado:

# Abierto
source: Open
es: Abierto

# Cerrado
source: Closed
es: Cerrado

source: Project status: %@
es: Estado: %@

source: Delete project
es: Borrar proyecto

# delete_project_hint
source: Permanently removes this project
es: Elimina este proyecto de Firebase

source: Pending request
es: Solicitud pendiente

# pending_request_hint
source: There are pending requests for this project
es: Hay solicitudes pendientes para este proyecto

# loading_info
source: Loading information...
es: Cargando información...

# loading_project_info
source: Loading project information
es: Cargando información del proyecto

source: Loading details...
es: Cargando detalles...

source: Loading request details...
es: Cargando detalles de la solicitud

# project_info
source: Project Information
es: Información del Proyecto

source: Description:
es: Descripción:

source: Languages:
es: Lenguajes:

source: Weekly hours:
es: Horas semanales:

# collab_type
source: Collaboration type:
es: Tipo de colaboración:

source: Close Project
es: Cerrar Proyecto

source: Reopen Project
es: Reabrir Proyecto

# toggle_project_status
source: Change the project status
es: Cambia el estado del proyecto

source: No pending requests.
es: No hay solicitudes pendientes.

source: User
es: Usuario

# message_format
source: Message: %@
es: Mensaje: %@

source: No message
es: Sin mensaje

source: Participation request
es: Solicitud de participación

source: View request details
es: Ver detalles de la solicitud

source: Participation Requests
es: Solicitudes de Participación

source: No approved participants.
es: No hay participantes aprobados.

# participant_info
source: Participant: %@. Languages: %@
es: Participante: %@. Lenguajes: %@

source: Participants
es: Participantes

# delete_project_button
source: Delete Project
es: Eliminar Proyecto

# confirm_delete
source: Confirm deletion
es: Confirmar eliminación

source: Delete
es: Eliminar

source: Cancel
es: Cancelar

# confirm_delete_message
source: Are you sure you want to delete this project? This action cannot be undone.
es: ¿Estás seguro de que deseas eliminar este proyecto? Esta acción no se puede deshacer.

# creator_info
source: Creator Information
es: Información del Creador

# creator_name
source: Name:
es: Nombre:

# creator_name_accessibility
source: Creator name: %@
es: Nombre del creador: %@

# creator_description
source: Description:
es: Descripción:

# creator_description_accessibility
source: Creator description: %@
es: Descripción del creador: %@

# creator_languages
source: Languages:
es: Lenguajes:

# creator_languages_accessibility
source: Creator languages: %@
es: Lenguajes del creador: %@

source: Request Participation
es: Solicitar Participación

# request_participation_hint
source: Sends a request to the creator
es: Envía una solicitud al creador

source: Request Approved
es: Solicitud Aprobada

# request_approved_accessibility
source: Your request has been approved
es: Tu solicitud ha sido aprobada

source: Abandon Project
es: Abandonar Proyecto

# abandon_project_hint
source: You will no longer participate in this project
es: Dejas de participar en este proyecto

source: Request Rejected
es: Solicitud Rechazada

# request_rejected_accessibility
source: Your request was rejected
es: Tu solicitud ha sido rechazada

source: Request Pending
es: Solicitud Pendiente

# request_pending_accessibility
source: Your request is pending
es: Tu solicitud está pendiente

# no_approved_participants_accessibility
source: No approved participants
es: No hay participantes aprobados

# confirm_abandon
source: Confirm abandonment
es: Confirmar abandono

source: Abandon
es: Abandonar

# confirm_abandon_message
source: Are you sure you want to abandon this project?
es: ¿Estás seguro de que deseas abandonar este proyecto?

# request_details_title
source: Request Details
es: Detalles de la Solicitud

# request_details_accessibility
source: Details of the request
es: Detalles de la solicitud

# request_nav_title
source: Request
es: Solicitud

# user_name_format
source: Name: %@
es: Nombre: %@

# user_name_accessibility
source: User name: %@
es: Nombre del usuario: %@

# user_languages_format
source: Languages: %@
es: Lenguajes: %@

# user_languages_accessibility
source: User languages: %@
es: Lenguajes del usuario: %@

# user_description_format
source: Description: %@
es: Descripción: %@

# user_description_accessibility
source: User description: %@
es: Descripción del usuario: %@

# request_message_format
source: Message: %@
es: Mensaje: %@

# request_message_accessibility
source: User message: %@
es: Mensaje del usuario: %@

# approve_request
source: Approve
es: Aprobar

# approve_request_accessibility
source: Approve request
es: Aprobar solicitud

# approve_request_hint
source: Accept the participation request
es: Acepta la solicitud de participación

# reject_request
source: Reject
es: Rechazar

# reject_request_accessibility
source: Reject request
es: Rechazar solicitud

# reject_request_hint
source: Reject the participation request
es: Rechaza la solicitud de participación

source: Close
es: Cerrar

# close_request_view_accessibility
source: Close the request view
es: Cerrar la vista de solicitud

# close_request_view_hint
source: Go back to the previous screen
es: Regresa a la pantalla anterior

# participation_message_instructions
source: Write a message explaining why you want to participate:
es: Escribe un mensaje explicando por qué deseas participar:

# participation_message_instructions_accessibility
source: Describe why you want to join the project
es: Describe por qué deseas participar en el proyecto

# participation_message_instructions_hint
source: Explain your motivations and skills to join the project
es: Explica tus motivaciones y habilidades para unirte al proyecto

# request_message_field
source: Request message
es: Mensaje de solicitud

# request_message_field_hint
source: Explain your reasons for participating in this project
es: Explica las razones para participar en este proyecto

# request_message_placeholder
source: Write your motivation here...
es: Escribe aquí tu motivación...

# participation_request_title
source: Participation Request
es: Solicitud de Participación

# participation_request_title_accessibility
source: Participation request
es: Solicitud de participación

# cancel_button
source: Cancel
es: Cancelar

# cancel_button_accessibility
source: Cancel submission
es: Cancelar envío

# cancel_button_hint
source: Closes the form without sending the request
es: Cierra el formulario sin enviar la solicitud

# send_button
source: Send
es: Enviar

# send_button_accessibility
source: Send request
es: Enviar solicitud

# send_button_hint
source: Sends the message to the project owner
es: Envía el mensaje al creador del proyecto

# create_account
source: Create your account
es: Crea tu cuenta

# create_account_accessibility
source: Create your account
es: Crea tu cuenta

# start_session
source: Login
es: Inicia sesión

# start_session_accessibility
source: Login to your account
es: Inicia sesión

# login_email_placeholder
source: Email
es: Correo electrónico

# login_email_accessibility
source: Email
es: Correo electrónico

# login_email_hint
source: Enter your email to sign in
es: Introduce tu correo para iniciar sesión

# login_password_placeholder
source: Password
es: Contraseña

# login_password_accessibility
source: Password
es: Contraseña

# login_password_hint
source: Enter your login password
es: Introduce tu contraseña de acceso

# forgot_password_button
source: Forgot your password?
es: ¿Olvidaste tu contraseña?

# forgot_password_accessibility
source: Forgot my password
es: Olvidé mi contraseña

# forgot_password_hint
source: Sends a reset email if the address is valid
es: Envía un correo de restablecimiento si el email es válido

# resend_verification_button
source: Resend verification email
es: Reenviar correo de verificación

# resend_verification_accessibility
source: Resend verification
es: Reenviar correo de verificación

# resend_verification_hint
source: Requests a new email to verify your address
es: Solicita que se envíe nuevamente el correo para verificar tu dirección

# register_button
source: Register
es: Registrar

# register_button_accessibility
source: Register a new account
es: Registrar cuenta nueva

# register_button_hint
source: Creates a new account
es: Crea una cuenta nueva

# login_button
source: Login
es: Iniciar Sesión

# login_button_accessibility
source: Login to your account
es: Iniciar sesión

# login_button_hint
source: Sign in with your email and password
es: Accede a tu cuenta con tu email y contraseña

# already_have_account
source: Already have an account? Login
es: ¿Ya tienes cuenta? Inicia sesión

# already_have_account_accessibility
source: Access your account if you have one created
es: Accede a tu cuenta si ya tienes una creada

# dont_have_account
source: Don't have an account? Register
es: ¿No tienes cuenta? Regístrate

# dont_have_account_accessibility
source: Create a new account if you don't have one yet
es: Crea una cuenta nueva si no la tienes

# register_email_placeholder
source: Email
es: Correo electrónico

# register_email_accessibility
source: Email for registration
es: Correo electrónico para registro

# register_email_hint
source: Enter your email to sign up
es: Introduce tu correo para registrarte

# register_password_placeholder
source: Password
es: Contraseña

# register_password_accessibility
source: Password for registration
es: Contraseña para registro

# register_password_hint
source: Enter a password for your new account
es: Introduce tu contraseña para tu cuenta nueva

# register_name_placeholder
source: Name
es: Nombre

# register_name_accessibility
source: Name or alias field
es: Campo de nombre o alias

# register_name_hint
source: Enter your name or alias
es: Introduce tu nombre o alias

# register_description_placeholder
source: Description (e.g. Mobile Developer, Backend, UX/UI Design)
es: Descripción (ej. Mobile Developer, Backend, Diseño UX/UI)

# register_description_accessibility
source: Description field
es: Campo de descripción

# register_description_hint
source: Max %d characters. Briefly describe your experience or role.
es: Máximo %d caracteres. Describe tu experiencia o rol.

# register_description_counter_accessibility
source: Description used: %d out of %d characters
es: Descripción usada: %d de %d caracteres

# select_languages_accessibility
source: Open languages list
es: Selecciona lenguajes de programación

# languages_title
source: Programming Languages
es: Lenguajes de Programación

# languages_done_button
source: Done
es: Hecho

# languages_done_button_accessibility
source: Done
es: Hecho

# languages_done_button_hint
source: Closes the list of languages
es: Cierra la lista de lenguajes

# language_selected_hint
source: Currently selected. Tap to unselect
es: Actualmente seleccionado. Pulsa para deseleccionar

# language_unselected_hint
source: Not selected. Tap to select
es: No seleccionado. Pulsa para seleccionar

# edit_profile_section_header
source: Edit Profile
es: Editar Perfil

# edit_profile_name_placeholder
source: Name (max. %d characters)
es: Nombre (máx. %d caracteres)

# edit_profile_name_accessibility
source: Profile name
es: Nombre del perfil

# edit_profile_name_hint
source: Enter your name, up to %d characters.
es: Introduce tu nombre, máximo %d caracteres.

# edit_profile_description_label
source: Description (max. %d characters)
es: Descripción (máx. %d caracteres)

# edit_profile_description_accessibility
source: Profile description
es: Descripción del perfil

# edit_profile_description_hint
source: Max %d characters. Describe your role or experience
es: Máximo %d caracteres. Describe tu experiencia o rol

# edit_profile_description_placeholder
source: E.g. Mobile Developer, Backend, UX/UI Design...
es: Ej. Mobile Developer, Backend, Diseño UX/UI...

# edit_profile_description_counter_accessibility
source: Characters used: %d out of %d
es: Carácteres usados: %d de %d

# edit_profile_languages_accessibility
source: Programming languages
es: Lenguajes de programación

# edit_profile_languages_hint
source: Select the languages you usually work with
es: Selecciona lenguajes en los que sueles trabajar

# edit_profile_save_button
source: Save Changes
es: Guardar Cambios

# edit_profile_save_accessibility
source: Save changes
es: Guardar Cambios

# edit_profile_save_hint
source: Updates your profile with the entered data
es: Actualiza tu perfil con los datos ingresados

# profile_section_header
source: Profile
es: Perfil

# profile_user_name
source: Username: %@
es: Nombre de usuario: %@

# profile_user_name_hint
source: This is your profile name
es: Este es tu nombre de perfil

# profile_user_description
source: Description: %@
es: Descripción: %@

# profile_user_languages
source: Languages: %@
es: Lenguajes: %@

# profile_user_languages_accessibility
source: User languages: %@
es: Lenguajes del usuario: %@

# edit_profile_button
source: Edit profile
es: Editar perfil

# edit_profile_button_hint
source: Opens the screen to edit your profile
es: Abre la pantalla de edición de tu perfil

# profile_created_projects_header
source: My created projects
es: Mis proyectos creados

# profile_no_created_projects
source: You have no created projects.
es: No tienes proyectos creados.

# profile_no_created_projects_accessibility
source: No created projects found
es: No tienes proyectos creados

# closed_project_delete_hint
source: Project is closed, you can remove it
es: Proyecto cerrado, puedes eliminarlo

# profile_participations_header
source: Projects you participate in
es: Proyectos en los que participas

# profile_no_participations
source: You are not participating in any project.
es: No participas en ningún proyecto.

# profile_no_participations_accessibility
source: No project participations found
es: No participas en ningún proyecto

# logout_button
source: Log out
es: Cerrar sesión

# logout_button_accessibility
source: Log out
es: Cerrar sesión

# logout_button_hint
source: Your session will be closed in this app
es: Se cerrará tu sesión en la aplicación

source: Loading profile...
es: Cargando perfil...

# loading_profile_accessibility
source: Loading user profile
es: Cargando el perfil del usuario

# crear_proyecto_nombre_placeholder
source: Project name (max. %d characters)
es: Nombre del proyecto (máx. %d caracteres)

# crear_proyecto_nombre_accessibility
source: Project name (up to %d characters)
es: Nombre del proyecto. Máximo %d caracteres

# crear_proyecto_nombre_hint
source: Enter the project name, up to %d characters
es: Introduce el nombre del proyecto, máximo %d caracteres

# crear_proyecto_descripcion_accessibility
source: Project description
es: Descripción del proyecto

# crear_proyecto_descripcion_hint
source: Explain your project idea, up to %d characters
es: Máximo %d caracteres. Explica de qué trata el proyecto

# crear_proyecto_descripcion_placeholder
source: Description
es: Descripción

# crear_proyecto_informacion_principal
source: Main information
es: Información principal

# crear_proyecto_detalles_header
source: Project details
es: Detalles del proyecto

# crear_proyecto_lenguajes_accessibility
source: Programming languages
es: Lenguajes de programación

# crear_proyecto_lenguajes_hint
source: Select the required languages for this project
es: Selecciona los lenguajes necesarios para este proyecto

# crear_proyecto_horas_placeholder
source: Weekly hours
es: Horas semanales

# crear_proyecto_horas_accessibility
source: Weekly hours
es: Horas semanales

# crear_proyecto_horas_hint
source: How many hours will you dedicate to the project each week?
es: Número aproximado de horas que dedicarás

# crear_proyecto_colaboracion_placeholder
source: Collaboration type (max. %d characters)
es: Tipo de colaboración (máx. %d caracteres)

# crear_proyecto_colaboracion_accessibility
source: Collaboration type
es: Tipo de colaboración

# crear_proyecto_colaboracion_hint
source: For example: remote, on-site, or hybrid...
es: Ejemplo: remoto, presencial, híbrido

# crear_proyecto_boton
source: Create Project
es: Crear Proyecto

# crear_proyecto_boton_accessibility
source: Create project
es: Crear proyecto

# crear_proyecto_boton_hint
source: Saves the project and closes the window
es: Guarda el proyecto y cierra la ventana

# crear_proyecto_cerrar_boton
source: Close
es: Cerrar

# crear_proyecto_cerrar_accessibility
source: Close creation screen
es: Cerrar pantalla de creación

# crear_proyecto_cerrar_hint
source: Cancels project creation and goes back
es: Cancela la creación de proyecto y vuelve atrás

# explorar_no_created_projects
source: You haven't created any project.
es: No has creado ningún proyecto.

# explorar_created_project_hint
source: View details of your created project
es: Ver detalles del proyecto creado

# explorar_created_projects_header
source: My Created Projects
es: Mis proyectos creados

# explorar_no_participation
source: You are not participating in any project.
es: No participas en ningún proyecto.

# explorar_participation_project_hint
source: View details of the project you participate in
es: Ver detalles del proyecto en el que participas

# explorar_participation_header
source: Projects you're participating in
es: Proyectos en los que participas

# explorar_filter_language_label
source: Filter by language:
es: Filtrar por lenguaje:

# explorar_filter_language_all
source: All
es: Todos

# explorar_filter_language_accessibility
source: Language filter
es: Filtro de lenguaje

# explorar_filter_language_hint
source: Choose a language to filter projects
es: Selecciona el lenguaje para filtrar proyectos

# explorar_no_open_projects
source: No open projects available.
es: No hay proyectos abiertos disponibles.

# explorar_open_project_hint
source: View details of the open project
es: Ver detalles del proyecto abierto

# explorar_open_projects_header
source: Open Projects
es: Proyectos Abiertos

# loading_view_icon_accessibility
source: Loading DevCollab
es: Cargando DevCollab

# loading_view_text
source: Connecting to DevCollab...
es: Conectando con DevCollab...

# loading_view_progress_accessibility
source: Connecting
es: Conectando

# loading_view_progress_hint
source: Please wait while the connection is established
es: Por favor, espera mientras se establece la conexión

# auth_container_logout_error
source: ❌ Error logging out: %@
es: ❌ Error al cerrar sesión: %@

# crear_proyecto_vm_missing_fields
source: Some fields are missing.
es: Faltan campos por rellenar

# crear_proyecto_vm_invalid_hours
source: Weekly hours must be a valid number greater than 0.
es: Las horas semanales deben ser un número válido mayor que 0.

# crear_proyecto_vm_too_many_projects
source: You already have 2 created projects. You cannot create more.
es: Ya tienes 2 proyectos creados. No puedes crear más.

# crear_proyecto_vm_project_created
source: Project created successfully.
es: Proyecto creado exitosamente.

# detalle_proyecto_participant_added
source: Participant added successfully
es: Participante agregado correctamente

# detalle_proyecto_could_not_add_participant
source: Could not add participant.
es: No se pudo agregar al participante.

# detalle_proyecto_state_changed_format
source: Project changed to state: %@
es: Proyecto cambiado a estado: %@

# detalle_proyecto_could_not_change_state
source: Could not change the project state.
es: No se pudo cambiar el estado del proyecto.

# detalle_proyecto_request_sent
source: Request sent successfully.
es: Solicitud enviada correctamente.

# detalle_proyecto_request_state_format
source: Request %@
es: Solicitud %@

# detalle_proyecto_could_not_update_request_format
source: Could not update the request to %@.
es: No se pudo actualizar la solicitud a %@.

# detalle_proyecto_abandon_success
source: You have left the project successfully.
es: Has abandonado el proyecto correctamente.

# detalle_proyecto_abandon_error_format
source: Error leaving the project: %@
es: Error al abandonar el proyecto: %@

# detalle_proyecto_deleted_success
source: Project deleted successfully
es: Proyecto eliminado correctamente

# detalle_proyecto_deleted_error_format
source: Error deleting project: %@
es: Error al eliminar proyecto: %@

# login_vm_error_fetch_user
source: ❌ Error fetching user.
es: ❌ Error al obtener el usuario.

# login_vm_missing_email_password
source: ❌ Please enter your email and password.
es: ❌ Por favor, introduce tu email y contraseña.

# login_vm_login_successful
source: ✅ Login successful.
es: ✅ Login exitoso.

# login_vm_reset_mail_sent
source: ✅ Recovery email sent.
es: ✅ Correo de recuperación enviado.

# login_vm_reset_mail_error
source: ❌ Error sending recovery email.
es: ❌ Error al enviar el correo de recuperación.
